Revit 2027 API
LinkedResourceOpeningEventArgs Properties
The LinkedResourceOpeningEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
LinkedResourcePathName |  Path of the linked resource.
ResourceType |  The desired linked resource type.
Top
See Also
Reference
LinkedResourceOpeningEventArgs Class
Autodesk.Revit.DB.Events Namespace